const courses = [
    {
        title: "Основы программирования",
        description: "Базовый курс по пониманию программ и созданию приложений",

        lessons: [
            {
                title: "Урок 1. Как работает программа и сайт",

                theory: [
                    "Что такое программа",
                    "Ввод данных",
                    "Обработка данных",
                    "Вывод данных",
                    "HTML",
                    "CSS",
                    "JavaScript"
                ],

                practice: "Определить ввод, обработку и вывод у трёх программ",

                result: {
                    score: 11,
                    skill: "Понимание базовой логики программ",
                    level: "Начальный"
                }
            }
        ]
    }
];
